#+TITLE: Useful One-Line Scripts for Sed
#+AUTHOR: Eric Pement
#+DATE: 2005
#+EMAIL: evan@mantle.co
#+CREATOR: Evan Nagle
#+TAGS: @pdf @sed

* File Spacing
  :PROPERTIES:
  :header-args: :results scalar
  :END:
  
** G = double space
  #+BEGIN_SRC sh
    sed G data/lines.txt
  #+END_SRC

  #+RESULTS:
  : Line 1
  : 
  : Line 2
  : 
  : Line 3
  : 
  : Line 4
  : 

** /^$/d = delete blank lines  

#+BEGIN_SRC sh
  sed '/^$/d' data/jabberwocky.poem
#+END_SRC

#+RESULTS:
#+begin_example
’Twas brillig, and the slithy toves 
      Did gyre and gimble in the wabe: 
All mimsy were the borogoves, 
      And the mome raths outgrabe. 
“Beware the Jabberwock, my son! 
      The jaws that bite, the claws that catch! 
Beware the Jubjub bird, and shun 
      The frumious Bandersnatch!” 
He took his vorpal sword in hand; 
      Long time the manxome foe he sought— 
So rested he by the Tumtum tree 
      And stood awhile in thought. 
And, as in uffish thought he stood, 
      The Jabberwock, with eyes of flame, 
Came whiffling through the tulgey wood, 
      And burbled as it came! 
One, two! One, two! And through and through 
      The vorpal blade went snicker-snack! 
He left it dead, and with its head 
      He went galumphing back. 
“And hast thou slain the Jabberwock? 
      Come to my arms, my beamish boy! 
O frabjous day! Callooh! Callay!” 
      He chortled in his joy. 
’Twas brillig, and the slithy toves 
      Did gyre and gimble in the wabe: 
All mimsy were the borogoves, 
      And the mome raths outgrabe.
#+end_example

** /^$/d;G = delete blank links, then double space

#+BEGIN_SRC sh
  sed '/^$/d;G' data/jabberwocky.poem
#+END_SRC

#+RESULTS:
#+begin_example
’Twas brillig, and the slithy toves 

      Did gyre and gimble in the wabe: 

All mimsy were the borogoves, 

      And the mome raths outgrabe. 

“Beware the Jabberwock, my son! 

      The jaws that bite, the claws that catch! 

Beware the Jubjub bird, and shun 

      The frumious Bandersnatch!” 

He took his vorpal sword in hand; 

      Long time the manxome foe he sought— 

So rested he by the Tumtum tree 

      And stood awhile in thought. 

And, as in uffish thought he stood, 

      The Jabberwock, with eyes of flame, 

Came whiffling through the tulgey wood, 

      And burbled as it came! 

One, two! One, two! And through and through 

      The vorpal blade went snicker-snack! 

He left it dead, and with its head 

      He went galumphing back. 

“And hast thou slain the Jabberwock? 

      Come to my arms, my beamish boy! 

O frabjous day! Callooh! Callay!” 

      He chortled in his joy. 

’Twas brillig, and the slithy toves 

      Did gyre and gimble in the wabe: 

All mimsy were the borogoves, 

      And the mome raths outgrabe.

#+end_example

** G;G = triple space a file
** n;d = Undo double spacing; n = next

#+BEGIN_SRC sh
sed 'n;d' data/lines.txt
#+END_SRC

#+RESULTS:
: Line 1
: Line 3
